zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v3.c
    if (CY_CAPSENSE_BIST_DR_PIN2GND == mode)
    {
        eltdDM = CY_GPIO_DM_PULLUP;
    }

    eltdNum = context->ptrWdConfig[widgetId].ptrEltdConfig[ioSnsId].numPins;

    /* Loop through all electrodes of the specified sensor */
    for (i = 0u; i < eltdNum; i++)
    {
        /* Set pin Drive mode and data register */
        Cy_CapSense_BistSetPinDr(ioPtr, (mode ^ 0x01u));
        Cy_CapSense_BistSetPinPc(ioPtr, eltdDM);
        /* Wait for establishing the transition process */
        Cy_SysLib_DelayUs((uint16_t)context->ptrBistContext->snsIntgShortSettlingTime);
        /* Read the electrode state */
        eltdState = Cy_GPIO_Read(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber);
        if (CY_CAPSENSE_BIST_DR_PIN2GND != eltdState)
        {
            eltdState = CY_CAPSENSE_BIST_DR_PIN2VDD;
        }
        /* Revert the electrode to the default Drive mode */
        Cy_CapSense_BistSetPinDr(ioPtr, mode);
        Cy_CapSense_BistSetPinPc(ioPtr, CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF);
        /* Check the electrode state */
        if (mode == eltdState)
        {
            result = CY_CAPSENSE_BIST_FAIL_E;
            break;
        }
        else
        {
            result = CY_CAPSENSE_BIST_SUCCESS_E;
        }
        /* Get the next electrode */
        ioPtr++;
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SnsShortUpdateTestResult
****************************************************************************//**
* The internal function updates the BIST data structure and Widget Working bit
* in the .status field of the cy_stc_capsense_widget_context_t structure.
*
* The function resets a Widget Working bit, checks the .testResultMask field
* of the cy_stc_capsense_bist_context_t structure
* for the CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK bit and if it was not set to 1,
* the function sets it and memorizes widgetId and sensorId
* in corresponding fields of the cy_stc_capsense_bist_context_t structure.
*
* \param widgetId
* Specifies the ID number of the widget to be processed.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget which
* will be processed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_SnsShortUpdateTestResult(
                uint32_t widgetId,
                uint32_t sensorId,
                cy_stc_capsense_context_t * context)
{
    /* Marks widget non-working */
    (void)Cy_CapSense_SetWidgetStatus(widgetId, 0u, CY_CAPSENSE_WD_WORKING_MASK, context);
    if (0Lu == (context->ptrBistContext->testResultMask & CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK))
    {
        /* Write to the BIST context structure widgetId and sensorId of the first shorted sensor */
        context->ptrBistContext->testResultMask |= CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK;
        context->ptrBistContext->shortedWdId = (uint8_t)widgetId;
        context->ptrBistContext->shortedSnsId = (uint8_t)sensorId;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SnsShortCheckAllSensors
****************************************************************************//**
*
* The internal function that checks for all the sensors short.
*
* The function that checks for shorts on VDD/GND or to another sensors of all
* sensor (not electrode) by using the Cy_CapSense_SnsShortCheckSensor() function.
* The function is called by the Cy_CapSense_RunSelfTest() function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the test processing:
* - CY_CAPSENSE_BIST_SUCCESS_E if test passed successfully;
* - CY_CAPSENSE_BIST_FAIL_E if any sensor of any widget is
*   shorted to VDD or GND.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_SnsShortCheckAllSensors(
                cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;
    uint32_t sensorId;
    uint32_t numWdgtElectrodes;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_SUCCESS_E;

    /* Previously-captured HW resources were released by the other mode in the RunSelfTest function */
    /* Switch HW resource configuration to sensor short test */
    Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_SHORT_E, CY_CAPSENSE_UNDEFINED_GROUP, 0u,
                                   context);

    Cy_CapSense_BistSwitchAllSnsPinState(CY_CAPSENSE_BIST_IO_STRONG_HIGH_E, context);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        Cy_CapSense_BistSwitchAllShieldPinState(CY_CAPSENSE_BIST_IO_STRONG_HIGH_E, context);
    #endif
    Cy_CapSense_BistSwitchAllExternalCapPinState(CY_CAPSENSE_BIST_IO_STRONG_HIGH_E, context);

    /* Wait for the maximum possible external capacitor charging time */
    Cy_SysLib_DelayUs(context->ptrBistContext->snsIntgShortSettlingTime);

    for (widgetId = 0u; widgetId < context->ptrCommonConfig->numWd; widgetId++)
    {
        /* Get a total number of the widget elements: for CSX it is numRows + numCols, for CSD it is totalNumSns */
        if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            /* For the CSX widgets, get the index of the Rx electrode */
            numWdgtElectrodes = context->ptrWdConfig[widgetId].numRows +
                      (uint32_t)context->ptrWdConfig[widgetId].numCols;
        }
        else
        {
            numWdgtElectrodes = context->ptrWdConfig[widgetId].numSns;
        }

        for (sensorId = 0u; sensorId < numWdgtElectrodes; sensorId++)
        {
            if (CY_CAPSENSE_BIST_SUCCESS_E != Cy_CapSense_SnsShortCheckSensor(widgetId, sensorId, CY_CAPSENSE_BIST_DR_PIN2VDD, context))
            {
                result = CY_CAPSENSE_BIST_FAIL_E;
                break;
            }
        }
    }

