zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v3.c
    uint32_t wdIndex;
    uint32_t snsIndex;
    uint32_t curChIndex;
    uint32_t curSlotIndex;
    uint32_t scanSlotIndexValid;
    const cy_stc_capsense_common_config_t * ptrCommonCfg;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_BAD_PARAM_E;

    if (NULL != context)
    {
        if (CY_CAPSENSE_SLOT_COUNT > slotId)
        {
            if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
            {
                ptrCommonCfg = context->ptrCommonConfig;

                /* Set the BUSY status */
                context->ptrCommonContext->status = CY_CAPSENSE_BUSY | CY_CAPSENSE_MW_STATE_BIST_MASK;
                (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY, context);
                /* Set the slot measurement mode for the BIST scan */
                context->ptrBistContext->eltdCapScanMode = CY_CAPSENSE_BIST_CAP_SLOT_SCAN;
                /* Store the current slot and the skip channel mask for the BIST scan */
                context->ptrBistContext->curBistSlotId = (uint16_t)slotId;
                context->ptrBistContext->skipChannelMask = (uint8_t)skipChMask;
                /* Initialize active scan structure for BIST scan */
                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                {
                    Cy_CapSense_SetBusyFlags(curChIndex, context);
                    curSlotIndex = slotId + ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT);
                    scanSlotIndexValid = curSlotIndex;
                    wdIndex = context->ptrScanSlots[curSlotIndex].wdId;
                    if (CY_CAPSENSE_SLOT_EMPTY == wdIndex)
                    {
                        #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
                            for (i = 0u; i < CY_CAPSENSE_TOTAL_CH_NUMBER; i++)
                            {
                                /* Seek for the real sensor's slot index (not empty, not Tx only, not shield) */
                                if (CY_CAPSENSE_SLOT_SHIELD_ONLY >
                                    context->ptrScanSlots[slotId + ((i + ptrCommonCfg->channelOffset)
                                                                    * CY_CAPSENSE_SLOT_COUNT)].wdId)
                                {
                                    scanSlotIndexValid = slotId + ((i + ptrCommonCfg->channelOffset)
                                                                   * CY_CAPSENSE_SLOT_COUNT);
                                    break;
                                }
                            }
                            if (i == CY_CAPSENSE_TOTAL_CH_NUMBER)
                            {
                                result = CY_CAPSENSE_BIST_BAD_CONFIG_E;
                            }
                        #else
                            result = CY_CAPSENSE_BIST_BAD_CONFIG_E;
                        #endif /* (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u) */
                    }
                    else if (CY_CAPSENSE_SLOT_SHIELD_ONLY <= wdIndex)
                    {
                        /* The snsId field keeps the channel number of the valid slot for Tx only slots */
                        scanSlotIndexValid = ((uint32_t)context->ptrScanSlots[curSlotIndex].snsId * CY_CAPSENSE_SLOT_COUNT) +
                                             slotId;
                    }
                    else
                    {
                        scanSlotIndexValid = curSlotIndex;
                    }
                    if (CY_CAPSENSE_BIST_BAD_CONFIG_E != result)
                    {
                        /* Initializes for each channel the active sensor structure for the current sensor */
                        wdIndex = context->ptrScanSlots[scanSlotIndexValid].wdId;
                        snsIndex = context->ptrScanSlots[scanSlotIndexValid].snsId;
                        Cy_CapSense_InitActivePtr(curChIndex, wdIndex, snsIndex, context);
                    }
                }
                if (CY_CAPSENSE_BIST_BAD_CONFIG_E != result)
                {
                    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                        /* Skip Cp measurement for slots containing widgets using external Cref */
                        wdIndex = context->ptrScanSlots[slotId].wdId;
                        if ((CY_CAPSENSE_SLOT_SHIELD_ONLY > wdIndex) &&
                            (CY_CAPSENSE_CREF_SOURCE_EXTERNAL == context->ptrWdConfig[wdIndex].cRefSource))
                        {
                            result = CY_CAPSENSE_BIST_BAD_CONFIG_E;
                        }
                    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */
                }
                if (CY_CAPSENSE_BIST_BAD_CONFIG_E != result)
                {
                    /* Define the current ISC for BIST scan.
                     * The CSD or CSX group is the same for all slot sensors, choose the #0u channel
                     */
                    if (CY_CAPSENSE_CSD_GROUP == context->ptrActiveScanSns[0u].currentSenseMethod)
                    {
                        context->ptrBistContext->currentISC = context->ptrBistContext->intrEltdCapCsdISC;
                        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
                            context->ptrInternalContext->csdInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
                            /* Change Drive mode and HSIOM depending on the current inactive sensor connection */
                            if (CY_CAPSENSE_BIST_IO_STRONG_E == context->ptrBistContext->currentISC)
                            {
                                context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
                            }
                            else if (CY_CAPSENSE_BIST_IO_HIGHZA_E == context->ptrBistContext->currentISC)
                            {
                                /* Do nothing */
                            }
                            else if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->currentISC)
                            {
                                context->ptrInternalContext->csdInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
                                if (CY_CAPSENSE_SHIELD_PASSIVE == context->ptrCommonConfig->csdShieldMode)
                                {
                                    context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
                                }
                            }
                            else
                            {
                                /* Do nothing */
                            }
                        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
                    }
                    else
                    {
                        context->ptrBistContext->currentISC = context->ptrBistContext->intrEltdCapCsxISC;
                        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
                            context->ptrInternalContext->csxInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
                            /* Change Drive mode and HSIOM depending on the current inactive sensor connection */
                            if (CY_CAPSENSE_BIST_IO_STRONG_E == context->ptrBistContext->currentISC)
                            {
                                context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
                            }
                        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
                    }
                    /* Switch the HW resource configuration to the sensor element capacitance measurement */
                    Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_ELTD_CAP_E,
                                                   context->ptrActiveScanSns[0u].currentSenseMethod,
                                                   CY_CAPSENSE_BIST_CAP_SLOT_SCAN,
                                                   context);
                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                        for (curChIndex = 0u; curChIndex < context->ptrCommonConfig->numChannels; curChIndex++)
                        {
                            if (((0x01uL << curChIndex) & skipChMask) == 0u)
                            {
                                curSlotIndex = slotId + ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT);
                                if ((context->ptrScanSlots[curSlotIndex].wdId != CY_CAPSENSE_SLOT_EMPTY) &&
                                   (context->ptrScanSlots[curSlotIndex].wdId != CY_CAPSENSE_SLOT_SHIELD_ONLY))
                                   {
                                       Cy_CapSense_ConnectSensor(curChIndex, context);
                                   }
                            }
                        }
                    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
                    result = Cy_CapSense_BistMeasureCapacitanceSlot(slotId, context);
                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                        for (curChIndex = 0u; curChIndex < context->ptrCommonConfig->numChannels; curChIndex++)
                        {
                            if (((0x01uL << curChIndex) & skipChMask) == 0u)
                            {
                                curSlotIndex = slotId + ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT);
                                if ((context->ptrScanSlots[curSlotIndex].wdId != CY_CAPSENSE_SLOT_EMPTY) &&
                                   (context->ptrScanSlots[curSlotIndex].wdId != CY_CAPSENSE_SLOT_SHIELD_ONLY))
                                   {
                                       Cy_CapSense_DisconnectSensor(curChIndex, context);
                                   }
                            }
                        }
                    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */
                }
                /* Clear the BUSY flag */
                context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
            }
            else
            {
                result = CY_CAPSENSE_BIST_HW_BUSY_E;
            }
        }
    }

    return result;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorEnable
****************************************************************************//**
*
* The internal function sets up the MSC HW block to perform electrode
* (sensor or shield) capacitance measuring.
*
* This function prepares the MSC HW block to CSD FW sensing mode
* with BIST-defined parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_BistMeasureCapacitanceSensorEnable(
                cy_stc_capsense_context_t * context)
{
    cy_en_msc_status_t mscStatus;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t curChIndex;
    const cy_stc_msc_base_config_t cy_capsense_BistBaseTemplate = CY_CAPSENSE_BIST_SENSING_METHOD_BASE_TEMPLATE;

