zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v3.c
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        /* Get mask for all channel pins */
        padMask = context->ptrCommonConfig->ptrChConfig[chIndex].ptrHwBase->CSW_CTL;
        /* Change the control switch function depending on the current inactive sensor connection */
        cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
        if (CY_CAPSENSE_BIST_IO_HIGHZA_E == context->ptrBistContext->currentISC)
        {
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
        }
        else if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->currentISC)
        {
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD;
        }
        #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE)
        else if (CY_CAPSENSE_BIST_IO_VDDA2_E == context->ptrBistContext->currentISC)
        {
            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2;
            context->ptrCommonConfig->ptrChConfig[chIndex].ptrHwBase->MODE[mode].SW_SEL_TOP |=
                                                                                         MSC_MODE_SW_SEL_TOP_RMF_Msk;
            context->ptrCommonConfig->ptrChConfig[chIndex].ptrHwBase->MODE[mode].SW_SEL_SH =
                                                                CY_CAPSENSE_FW_CSX_VDDA2_CTLMUX_MODE_SW_SEL_SH_VALUE;
        }
        #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE) */
        else
        {
            /* Do nothing */
        }
        /* Set the control mux switch registers for inactive pins */
        Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);

        #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
            /* Set inactive ext cref pads to HIGH_Z to disconnect from sense bus */
            if (NULL != context->ptrExtCrefPinConfig)
            {
                padMask = 0u;
                if ((chIndex + context->ptrCommonConfig->channelOffset) ==
                    context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].chId)
                {
                    padMask |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].padNumber);
                }
                if ((chIndex + context->ptrCommonConfig->channelOffset) ==
                    context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].chId)
                {
                    padMask |= (uint32_t)(0x01uL << (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].padNumber);
                }
                Cy_CapSense_CalculateMaskRegisters(padMask, CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z, ptrSensorCfg);
            }
        #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

        /* Check for active electrodes */
        if (0u == ((1u << (chIndex + context->ptrCommonConfig->channelOffset)) &
                    context->ptrBistContext->skipChannelMask))
        {
            if ((CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
                (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
                ((CY_CAPSENSE_BIST_CAP_SLOT_SCAN == context->ptrBistContext->eltdCapScanMode) &&
                 ((CY_CAPSENSE_SLOT_EMPTY != slotStcWdgtIdx) && (CY_CAPSENSE_SLOT_SHIELD_ONLY != slotStcWdgtIdx))))
            {
                /* Initializes an active sensor (including ganged sensors) by SNS sensor state */
                if (CY_CAPSENSE_BIST_CAP_SHIELD_SCAN == context->ptrBistContext->eltdCapScanMode)
                {
                    /* Generate CTRL_MUX masks for the electrode or CSD sensor connection */
                    cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
                    if (CY_CAPSENSE_BIST_IO_SHIELD_E == context->ptrBistContext->currentISC)
                    {
                        padMask = context->ptrCommonConfig->ptrChConfig[chIndex].ptrHwBase->CSW_CTL;
                    }
                    else
                    {
                        padMask = 0u;
                        for (i = 0u; i < context->ptrCommonConfig->csdShieldNumPin; i++)
                        {
                            /* Proceed only if the shield electrode is connected belongs to the current channel */
                            if ((chIndex + context->ptrCommonConfig->channelOffset) == context->ptrShieldPinConfig[i].chId)
                            {
                                padMask |= 0x01uL << context->ptrShieldPinConfig[i].padNumber;
                            }
                        }
                    }
                    Cy_CapSense_CalculateMaskRegisters(padMask, cswFuncNum, ptrSensorCfg);
                }
                else
                {
                    if ((CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode) ||
                        (CY_CAPSENSE_CSD_GROUP == context->ptrActiveScanSns[0u].currentSenseMethod))
                    {
                        /* Generate CTRL_MUX masks for the electrode or CSD sensor connection */
                        if (CY_CAPSENSE_BIST_CAP_ELTD_SCAN == context->ptrBistContext->eltdCapScanMode)
                        {
                            ptrEltdCfg = context->ptrBistContext->curPtrEltdCfg;
                        }
                        else
                        {
                            ptrEltdCfg = context->ptrActiveScanSns[chIndex].ptrEltdConfig;
                        }
                        cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
                        /* Proceed only if electrode configuration belongs to selected channel */
                        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltdCfg->chId)
                        {
                            Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
                        }
                    }
                    else
                    {
                        /* RX ELECTRODE */
                        if (CY_CAPSENSE_SLOT_SHIELD_ONLY > slotStcWdgtIdx)
                        {
                            cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_RX;
                            ptrEltdCfg = context->ptrActiveScanSns[chIndex].ptrRxConfig;
                            if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltdCfg->chId)
                            {
                                Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
                            }
                        }
                        /* TX ELECTRODE */
                        cswFuncNum = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                        ptrEltdCfg = context->ptrActiveScanSns[chIndex].ptrTxConfig;
                        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltdCfg->chId)
                        {
                            Cy_CapSense_BistGenerateSnsCfgMaskReg(ptrEltdCfg, ptrSensorCfg, cswFuncNum);
                        }
                    }
                }
            }
        }
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
}

