zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v3.c
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistDisableMode
****************************************************************************//**
*
* This internal function releases HW resources and pins captured by BIST
* to be used by other CAPSENSE&trade; modes.
*
* This function releases the shared HW resources like connection
* to the analog bus in the AMUX mode.
* The function does not configure HW block registers to the default state.
* It is used by the Cy_CapSense_SwitchHwConfiguration() function only at switching
* to another sensing mode.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistDisableMode(cy_stc_capsense_context_t * context)
{
    Cy_CapSense_BistSwitchAllSnsPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        Cy_CapSense_BistSwitchAllShieldPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #endif
    Cy_CapSense_BistSwitchAllExternalCapPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
        if (NULL != context->ptrExtCrefPinConfig)
        {
            Cy_CapSense_SsConfigPinRegisters(
                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pcPtr,
                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pinNumber,
                CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
            Cy_GPIO_Clr(context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pcPtr,
                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pinNumber);
            Cy_CapSense_SsConfigPinRegisters(
                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pcPtr,
                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pinNumber,
                CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_GPIO);
            Cy_GPIO_Clr(context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pcPtr,
                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pinNumber);
        }
    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

    context->ptrBistContext->hwConfig = CY_CAPSENSE_BIST_HW_UNDEFINED_E;
    context->ptrBistContext->currentISC = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistSwitchHwConfig
****************************************************************************//**
*
* This internal function switches the MSCv3 HW block configuration for
* BIST operations.
*
* The function checks the current MSCv3 HW block configuration.
* If it differs from a desired configuration, the function disables the current
* configuration and sets the desired one.
*
* \param hwCfg
* Specifies the desired configuration.
*
* \param bistSenseGroup
* Specifies the sense group to be scanned during the sensor or electrode
* capacitance measurement scan.
* The parameter does not matter for short tests.
*
* \param bistScanMode
* Specifies the scanning mode (by electrodes or by slots) during the sensor
* or electrode capacitance measurement scan.
* The parameter does not matter for short tests.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistSwitchHwConfig(
                cy_en_capsense_bist_hw_config_t hwCfg,
                uint8_t bistSenseGroup,
                uint8_t bistScanMode,
                cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN)
        uint32_t curChIndex;
    #endif

    if ((context->ptrBistContext->hwConfig != hwCfg) ||
        (context->ptrBistContext->eltdCapSenseGroup != bistSenseGroup) ||
        (context->ptrBistContext->eltdCapScanMode != bistScanMode))
    {
        context->ptrBistContext->hwConfig = hwCfg;
        context->ptrBistContext->eltdCapSenseGroup = bistSenseGroup;
        context->ptrBistContext->eltdCapScanMode = bistScanMode;
        /* Enable the specified mode */
        switch (hwCfg)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN)
                case CY_CAPSENSE_BIST_HW_SHORT_E:
                {
                    /* Configure all the MSC channels to perform pin integrity tests */
                    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                    {
                        context->ptrCommonConfig->ptrChConfig[curChIndex].ptrHwBase->CSW_CTL = 0x00u;
                    }
                    break;
                }
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
                case CY_CAPSENSE_BIST_HW_ELTD_CAP_E:
                {
                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                        Cy_CapSense_BistSwitchAllSnsPinState(context->ptrBistContext->currentISC, context);
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                            Cy_CapSense_BistSwitchAllShieldPinState(context->ptrBistContext->currentISC, context);
                        #endif
                    #else /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
                        Cy_CapSense_SetIOsInDefaultState(context);
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                            Cy_CapSense_SetShieldPinsInDefaultState(context);
                        #endif
                        for (curChIndex = 0u; curChIndex < context->ptrCommonConfig->numChannels; curChIndex++)
                        {
                            Cy_CapSense_SetCmodInDefaultState(curChIndex, context);
                        }
                    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */

                    (void)Cy_CapSense_BistMeasureCapacitanceSensorEnable(context);
                    break;
                }
                case CY_CAPSENSE_BIST_HW_ELTD_CAP_SH_E:
                {
                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                        Cy_CapSense_BistSwitchAllSnsPinState(context->ptrBistContext->intrEltdCapShieldISC, context);
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                            Cy_CapSense_BistSwitchAllShieldPinState(context->ptrBistContext->intrEltdCapShieldISC, context);
                        #endif
                    #else /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
                        Cy_CapSense_SetIOsInDefaultState(context);
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                            Cy_CapSense_SetShieldPinsInDefaultState(context);
                        #endif
                        for (curChIndex = 0u; curChIndex < context->ptrCommonConfig->numChannels; curChIndex++)
                        {
                            Cy_CapSense_SetCmodInDefaultState(curChIndex, context);
                        }
                    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */

                    (void)Cy_CapSense_BistMeasureCapacitanceSensorEnable(context);

                    break;
                }
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN) */

            default:
            {
                /* Nothing to do */
                break;
            }
        }
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorInit
****************************************************************************//**
*
* This internal function calculates the parameters for sensor, shield or
* electrode capacitance measurements.
*
* It is called by Cy_CapSense_BistDsInitialize() once at the CAPSENSE&trade; MW start.
*
* The following parameters of cy_stc_capsense_bist_context_t are used as
* an input for the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
*
* The function checks for parameter limitations and corrects the values before
* the calculation if they exceed.
*
* The following parameters of cy_stc_capsense_bist_context_t are updated
* by the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
* * .eltdCapSubConvNum
*
* Restarting CAPSENSE&trade; MW or calling of the Cy_CapSense_BistDsInitialize()
* function overwrites the output parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_BistMeasureCapacitanceSensorInit(
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_bist_context_t * ptrBistCxt = context->ptrBistContext;

    /* ModClk */
    if (0u == ptrBistCxt->eltdCapModClk)
    {
        ptrBistCxt->eltdCapModClk = (uint16_t)CY_CAPSENSE_BIST_ELTD_CAP_MODCLK_DIV_DEFAULT;
    }
    if (CY_CAPSENSE_BIST_ELTD_CAP_MAX_MODCLK < (context->ptrCommonConfig->periClkHz / ptrBistCxt->eltdCapModClk))
    {
        ptrBistCxt->eltdCapModClk <<= 1u;
    }

