zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_selftest_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistSwitchAllExternalCapPinState
****************************************************************************//**
*
* The internal function sets all the port control (PC), data (DR) and HSIOM
* registers of all external capacitor pins to the desired state.
*
* The function sets the desired state for the pin port control register (PC),
* the output data register (DR) and the HSIOM register for all external
* capacitor pins (Drive Mode, output state, and HSIOM state).
*
* \param desiredPinState
* Specifies the desired pin state. See the possible states
* in the cy_en_capsense_bist_io_state_t enum description.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistSwitchAllExternalCapPinState(
                cy_en_capsense_bist_io_state_t desiredPinState,
                const cy_stc_capsense_context_t * context)
{
    uint32_t desiredDriveMode = CY_CAPSENSE_DM_GPIO_ANALOG;
    en_hsiom_sel_t desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
    uint32_t desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;

    /* Change Drive mode and HSIOM depending on the current inactive sensor connection */
    if (CY_CAPSENSE_BIST_IO_STRONG_E == desiredPinState)
    {
        desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
        desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
        desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;
    }
    else if (CY_CAPSENSE_BIST_IO_STRONG_HIGH_E == desiredPinState)
    {
        desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
        desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
        desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2VDD;
    }
    else
    {
        /* Do nothing */
    }
    Cy_CapSense_BistSetAllCmodPinsState(desiredDriveMode, desiredPinOutput, desiredHsiom, context);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistWatchdogPeriodCalc
****************************************************************************//**
*
* The internal function calculates the watch-dog period for BIST sensor
* capacity measurement scans in CPU cycles.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the calculated watch-dog period for BIST sensor capacity measurement
* scans in CPU cycles:
*******************************************************************************/
static uint32_t Cy_CapSense_BistWatchdogPeriodCalc(
                const cy_stc_capsense_context_t * context)
{
    uint64_t isBusyWatchdogTimeUs;
    uint32_t modClkDivider;
    uint32_t watchdogPeriod;

    modClkDivider = context->ptrBistContext->eltdCapModClk;
    if (0u == modClkDivider)
    {
        modClkDivider = 1u;
    }

    isBusyWatchdogTimeUs  = ((uint64_t)context->ptrBistContext->eltdCapSnsClk) *
                            ((uint64_t)context->ptrBistContext->eltdCapSubConvNum);
    isBusyWatchdogTimeUs *= (uint64_t)modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
    isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;
    if (0u == isBusyWatchdogTimeUs)
    {
        isBusyWatchdogTimeUs = 1u;
    }
    isBusyWatchdogTimeUs *= CY_CAPSENSE_BIST_WATCHDOG_MARGIN_COEFF;
    watchdogPeriod = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs,
                                                   context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA,
                                                   CY_CAPSENSE_BIST_CAP_MEAS_WDT_CYCLES_PER_LOOP);
    return watchdogPeriod;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN) */

#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) */

#endif /* (defined(CY_IP_M0S8MSCV3)) */


/* [] END OF FILE */
